configuration/src/Catalogs/ЭтапыКанбана/ЭтапыКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыКанбана</name>
  <owners>Catalog.Филиалы</owners>
  <owners>Catalog.Процессы</owners>
  <attributes>
    <name>ПорядокОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКанбана</name>
    <type>
      <types>EnumRef.ТипыКанбана</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМаксимальноеКоличествоЗадач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМинимальноеКоличествоЗадач</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Переходы</name>
    <attributes>
      <name>ЭлементПерехода</name>
      <type>
        <types>CatalogRef.ЭтапыКанбана</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьВидыИсполнителей</name>
    <attributes>
      <name>ВидИсполнителя</name>
      <type>
        <types>EnumRef.ПринадлежностьИсполнителейКЗадаче</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыЭтапа</name>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ВидыЗадач</types>
        <types>CatalogRef.СтатусыОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/ТипыКанбана/ТипыКанбана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКанбана</name>
  <enumValues>
    <name>ЗадачаНовый</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРазработку</name>
  </enumValues>
  <enumValues>
    <name>Проекты</name>
  </enumValues>
  <enumValues>
    <name>Кастомный</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееЗаданиеНовый</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиМоегоФилиала</name>
  </enumValues>
  <enumValues>
    <name>ПулЗаявокНовый</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ПринадлежностьИсполнителейКЗадаче/ПринадлежностьИсполнителейКЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПринадлежностьИсполнителейКЗадаче</name>
  <enumValues>
    <name>НеНазначен</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>Внешний</name>
  </enumValues>
  <enumValues>
    <name>Любой</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Спринт/Спринт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Спринт</name>
  <comment>Документ для фиксации спринта по методологии Agile</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпринта</name>
    <type>
      <types>EnumRef.ВидыСпринта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Направления</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияРазработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <basedOn>Catalog.Проекты</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <comment>Дата создания</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКМаштабированию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПодготовки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаВТестирование</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановоеНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлановоеОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзмененияПодчиненных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <comment>Заказчик проекта</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <comment>Признак того, что этот проект является импортированной задачей Redmine</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткоеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <comment>Номер импортированной задачи Redmine</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <comment>Ссылка на другой объект БД, которому подчинен текущий объект</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения</name>
    <comment>Процент выполнения с шагом 10</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/Продукты/Продукты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Продукты</name>
  <attributes>
    <name>ВидОчереди</name>
    <type>
      <types>EnumRef.ВидыОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Системы</name>
    <attributes>
      <name>Система</name>
      <comment>система, которую затрагивает продукт</comment>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ГруппыЗаказчиковНаправлений/ГруппыЗаказчиковНаправлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыЗаказчиковНаправлений</name>
  <predefined>
    <items>
      <name>ПрочиеЗаказчики</name>
      <description>Прочие заказчики</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтветственных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалIT</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Направления</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Системы</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ЭтапыКанбана/Forms/УдалитьНастройкаОтборовИЭтапов/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбъявлениеПеременных

// Хранит пользовательскте настройки колонок
&НаКлиенте
Перем ПользовательскиеНастройкиКолонок;

&НаКлиенте
Перем КешВспомогательныхДанных;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.Свойство("ТипНастроек", ТипНастроек); 
	Параметры.Свойство("КлючНастроек", Канбан_КлючНастроек); 
	Филиал = ?(Параметры.Свойство("Филиал"), Параметры.Филиал, ПараметрыСеанса.Филиал);	
	ТипКанбана = ?(Параметры.Свойство("ТипКанбана"), Параметры.ТипКанбана, Перечисления.ТипыКанбана.ПустаяСсылка());	
	
	НастройкаОтбора = Неопределено;   
	
	НастройкаКанбана = Неопределено;
	Если Параметры.Свойство("НастройкиКанбан", НастройкаКанбана) Тогда 
		НастройкаОтбора = НастройкаКанбана.Фильтр;
	КонецЕсли;		
	
	ЗаполнитьТаблицуНастроек(НастройкаОтбора, ТипКанбана);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
	КешВспомогательныхДанных = ПолучитьКешВспомогательныхДанных();  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкиВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ВидСравнения = ВидСравнения.ВСписке ИЛИ ТекущиеДанные.ВидСравнения = ВидСравнения.НеВСписке Тогда
			Если ТипЗнч(ТекущиеДанные.ПравоеЗначение) <> Тип("СписокЗначений") Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущиеДанные.ЗначениеПоУмолчанию));
				
				СписокНаправлений = Новый СписокЗначений;
				СписокНаправлений.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
				ТекущиеДанные.ПравоеЗначение = СписокНаправлений;
				ТекущиеДанные.ТипДляСвязи = СписокНаправлений;
			КонецЕсли;
			
		Иначе
			Если ТипЗнч(ТекущиеДанные.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ТекущиеДанные.ПравоеЗначение = ТекущиеДанные.ЗначениеПоУмолчанию;
				ТекущиеДанные.ТипДляСвязи = ТекущиеДанные.ЗначениеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравоеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.ПравоеЗначение) Тогда
		ТекущиеДанные.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНастройку(Имя, ПоУмолчанию, Тип, Представление = "", Вид = Неопределено, Использование = Ложь)
	
	Если Вид = Неопределено Тогда
		Вид = ВидСравнения.Равно;
	КонецЕсли;
	
	НоваяСтрока = Настройки.Добавить();
	НоваяСтрока.Использование = Использование;
	НоваяСтрока.ИмяПоля = Имя;
	НоваяСтрока.ПредставлениеИмениПоля = ?(Представление = "", Имя, Представление);
	НоваяСтрока.ЗначениеПоУмолчанию = ПоУмолчанию;
	НоваяСтрока.ТипДляСвязи = Тип;
	НоваяСтрока.ВидСравнения = Вид;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроек(Знач НастройкаОтбора = Неопределено, ТипКанбана)
	
	ПользовательПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	ТегПустаяСсылка = Справочники.Теги.ПустаяСсылка();
	ПроектПустаяСсылка = Справочники.Проекты.ПустаяСсылка();
	ПродуктПустаяСсылка = Справочники.Продукты.ПустаяСсылка();
	СистемаПустаяСсылка = Справочники.СистемыУчета.ПустаяСсылка();
	НаправлениеПустаяСсылка = Справочники.НаправленияРазработки.ПустаяСсылка();
	ФилиалПустаяСсылка = Справочники.Филиалы.ПустаяСсылка();
	НазначениеПустаяСсылка = Справочники.НазначенияЗадач.ПустаяСсылка();
	СпринтПустаяСсылка = Документы.Спринт.ПустаяСсылка();
	ГруппаЗаказчиковПустаяСсылка = Справочники.ГруппыЗаказчиковНаправлений.ПустаяСсылка();
	
	Если ТипКанбана = Перечисления.ТипыКанбана.ВнутреннееЗаданиеНовый Тогда
		ДобавитьНастройку("Автор", ПользовательПустаяСсылка, ПользовательПустаяСсылка);
		ДобавитьНастройку("ДатаИзменения", Новый СтандартнаяДатаНачала, Новый СтандартнаяДатаНачала, "Дата изменения");
		ДобавитьНастройку("Назначение", НазначениеПустаяСсылка, НазначениеПустаяСсылка, "Назначение");
		ДобавитьНастройку("Направление", НаправлениеПустаяСсылка, НаправлениеПустаяСсылка, "Направление");
		ДобавитьНастройку("Проект", ПроектПустаяСсылка, ПроектПустаяСсылка);
		ДобавитьНастройку("Спринт", СпринтПустаяСсылка, СпринтПустаяСсылка);
		ДобавитьНастройку("Тег", ТегПустаяСсылка, ТегПустаяСсылка);
		
	ИначеЕсли ТипКанбана = Перечисления.ТипыКанбана.ЗаявкиМоегоФилиала Тогда
		ДобавитьНастройку("Тег", ТегПустаяСсылка, ТегПустаяСсылка);
		ДобавитьНастройку("Проект", ПроектПустаяСсылка, ПроектПустаяСсылка);
		ДобавитьНастройку("Спринт", СпринтПустаяСсылка, СпринтПустаяСсылка);
		ДобавитьНастройку("Продукт", ПродуктПустаяСсылка, ПродуктПустаяСсылка);
		ДобавитьНастройку("Автор", ПользовательПустаяСсылка, ПользовательПустаяСсылка);
		ДобавитьНастройку("ГруппаЗаказчиков", ГруппаЗаказчиковПустаяСсылка, ГруппаЗаказчиковПустаяСсылка, "Группа заказчиков");
		ДобавитьНастройку("Назначение", НазначениеПустаяСсылка, НазначениеПустаяСсылка, "Назначение");
		ДобавитьНастройку("Направление", НаправлениеПустаяСсылка, НаправлениеПустаяСсылка, "Направление");
		ДобавитьНастройку("СистемаУчета", СистемаПустаяСсылка, СистемаПустаяСсылка, "Система учета");

	ИначеЕсли ТипКанбана = Перечисления.ТипыКанбана.ПулЗаявокНовый Тогда
		ДобавитьНастройку("Тег", ТегПустаяСсылка, ТегПустаяСсылка);
		ДобавитьНастройку("Проект", ПроектПустаяСсылка, ПроектПустаяСсылка);
		ДобавитьНастройку("Спринт", СпринтПустаяСсылка, СпринтПустаяСсылка);
		ДобавитьНастройку("Автор", ПользовательПустаяСсылка, ПользовательПустаяСсылка);
		ДобавитьНастройку("Назначение", НазначениеПустаяСсылка, НазначениеПустаяСсылка, "Назначение");
		
	Иначе
		ДобавитьНастройку("Тег", ТегПустаяСсылка, ТегПустаяСсылка);
		ДобавитьНастройку("СистемаУчета", СистемаПустаяСсылка, СистемаПустаяСсылка, "Система учета");
		ДобавитьНастройку("Проект", ПроектПустаяСсылка, ПроектПустаяСсылка);
		ДобавитьНастройку("Команда", ФилиалПустаяСсылка, ФилиалПустаяСсылка);
		ДобавитьНастройку("Спринт", СпринтПустаяСсылка, СпринтПустаяСсылка);
		ДобавитьНастройку("Продукт", ПродуктПустаяСсылка, ПродуктПустаяСсылка);
		ДобавитьНастройку("Автор", ПользовательПустаяСсылка, ПользовательПустаяСсылка);
		ДобавитьНастройку("ДатаИзменения", Новый СтандартнаяДатаНачала, Новый СтандартнаяДатаНачала, "Дата изменения"); 
		ДобавитьНастройку("ГруппаЗаказчиков", ГруппаЗаказчиковПустаяСсылка, ГруппаЗаказчиковПустаяСсылка, "Группа заказчиков");
		ДобавитьНастройку("Назначение", НазначениеПустаяСсылка, НазначениеПустаяСсылка, "Назначение");
		ДобавитьНастройку("Направление", НаправлениеПустаяСсылка, НаправлениеПустаяСсылка, "Направление");
	КонецЕсли;

	ТипСтруктура = Тип("Структура");
	Если НастройкаОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Настройка Из НастройкаОтбора Цикл
		ЗначениеНастройки = Настройка.Значение; 
		
		Если ТипЗнч(ЗначениеНастройки) = ТипСтруктура Тогда
			НайденныеСтроки = Настройки.НайтиСтроки(Новый Структура("ИмяПоля", Настройка.Ключ));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденнаяСтрока = НайденныеСтроки.Получить(0);
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока, ЗначениеНастройки, "Использование, ВидСравнения, ПравоеЗначение");
				
				Если НайденнаяСтрока.ПравоеЗначение = Неопределено Тогда
					НайденнаяСтрока.ПравоеЗначение = НайденнаяСтрока.ЗначениеПоУмолчанию;
				КонецЕсли;
				
				НайденнаяСтрока.ТипДляСвязи = НайденнаяСтрока.ПравоеЗначение;
			КонецЕсли;
		Иначе
			ЭтотОбъект[Настройка.Ключ] = Настройка.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Настройки.Сортировать("ИмяПоля");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКешВспомогательныхДанных()
	
	// Получаем все значения перечисления.
	МассивВидыИсполнителей = Новый Массив;
	МассивВидыИсполнителей.Добавить(Перечисления.ПринадлежностьИсполнителейКЗадаче.НеНазначен);
	МассивВидыИсполнителей.Добавить(Перечисления.ПринадлежностьИсполнителейКЗадаче.Внутренний);
	МассивВидыИсполнителей.Добавить(Перечисления.ПринадлежностьИсполнителейКЗадаче.Внешний);
	
	КешВспомогательныхДанных = Новый Структура;
	КешВспомогательныхДанных.Вставить("МассивВидыИсполнителей", МассивВидыИсполнителей);
	КешВспомогательныхДанных.Вставить("ВнутреннийИсполнительСсылка", Перечисления.ПринадлежностьИсполнителейКЗадаче.Внутренний);
	
	Возврат КешВспомогательныхДанных;
	
КонецФункции

&НаКлиенте
Процедура Применить(Команда)

	Результат = Новый Структура;
	
	Для Каждого Строка Из Настройки Цикл
		Если ЗначениеЗаполнено(Строка.ПравоеЗначение) ИЛИ Строка.Использование Тогда
			СтруктураНастройки = Новый Структура("ВидСравнения, Использование, ПравоеЗначение");
			ЗаполнитьЗначенияСвойств(СтруктураНастройки, Строка);
			
			Если СтруктураНастройки.ПравоеЗначение = Неопределено Тогда
				СтруктураНастройки.ПравоеЗначение = Строка.ЗначениеПоУмолчанию;
			КонецЕсли;
			
			Результат.Вставить(Строка.ИмяПоля, СтруктураНастройки);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура("Фильтр", Результат);
		
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
